Repository: riganti/dotvvm-samples-academy
Catalog: src/DotvvmAcademy.Validation.Dothtml/Resources.*.resx
Languages: cs

# ERR_WrongSetter
source: This property must be set using {0}.
cs: Tato vlastnost musí být nastavena pomocí {0}.

# Setter_CommandBinding
source: a command binding
cs: command bindingu

# Setter_ControlCommandBinding
source: a control command binding
cs: control command bindingu

# Setter_ControlPropertyBinding
source: a control property binding
cs: control property bindingu

# Setter_HardcodedValue
source: a hard-coded value
cs: konstantní hodnoty

# Setter_ResourceBinding
source: a resource binding
cs: resource bindingu

# Setter_StaticCommandBinding
source: a static command binding
cs: static command bindingu

# Setter_ValueBinding
source: a value binding
cs: value bindingu

# ERR_WrongBindingValue
source: This property must be bound to: '{0}'.
cs: Tato vlastnost musí být bindovaná k: '{0}'.

# ERR_WrongHardcodedValue
source: This property must be set to '{0}'.
cs: Tato vlastnost musí být nastavena na '{0}'.

# ERR_WrongControlType
source: This control must be of type '{0}'.
cs: Tato komponenta musí být typu '{0}'.

# ERR_WrongTypeDirectiveArgument
source: The '{0}' directive must reference type '{1}'.
cs: Directiva '{0}' musí referencovat typ '{1}'.

# ERR_WrongControlCount
source: This control must contain {0} controls of type '{1}'.
cs: Tato komponenta musí obsahovat {0} komponent typu '{1}'.

# ERR_MissingPropertyRoot
source: The '{0}' directive must be set.
cs: Directiva '{0}' musí být nastavena.

# ERR_MissingControl
source: This control is missing a control of type '{0}'.
cs: Tato komponenta musí obsahovat komponentu typu '{0}'.

# ERR_MissingProperty
source: This control must have its '{0}' property set.
cs: Tato komponenta musí mít nastavenu vlastnost '{0}'.

# ERR_MissingControlRoot
source: The document root is missing a control of type '{0}'.
cs: Na stránce musí být komponenta typu '{0}'.

# ERR_MissingElement
source: This control is missing an HTML '{0}' element.
cs: Tato komponenta musí obsahovat HTML element '{0}'.

# ERR_MissingElementRoot
source: The document root is missing an HTML '{0}' element.
cs: Na stránce musí být HTML element '{0}'.

# ERR_WrongElementCount
source: This control must contain {0} '{1}' elements.
cs: Tato komponenta musí obsahovat {0} elementů '{1}'.

# ERR_WrongControlCountRoot
source: The document root must contain {0} controls of type '{1}'.
cs: Na stránce musí být {0} komponent typu '{1}'.

# ERR_WrongElementCountRoot
source: The document root must contain {0} '{1}' elements.
cs: Na stránce musí být {0} HTML elementů '{1}'.

# ERR_WrongRawContent
source: This control must contain: '{0}'.
cs: Tato komponenta musí obsahovat: '{0}'.

# ERR_WrongRawText
source: This control must be declared in this way: '{0}'.
cs: Tato komponenta musí být deklarována takto: '{0}'.

# Setter_Or
source: , or
cs: , nebo
